FranciscoLlobet/efm32-freertos-zig/csrc/system/cc3100-sdk/netapps/mqtt/sl/sl_mqtt_client.c
/******************************************************************************
*
*   Copyright (C) 2014 Texas Instruments Incorporated
*
*   All rights reserved. Property of Texas Instruments Incorporated.
*   Restricted rights to use, duplicate or disclose this code are
*   granted through contract.
*
*   The program may not be used without the written permission of
*   Texas Instruments Incorporated or against the terms and conditions
*   stipulated in the agreement under which this program has been supplied,
*   and under no circumstances can it be used with non-TI connectivity device.
*
******************************************************************************/

#include "sl_mqtt_client.h"
#include "mqtt_client.h"
#include "cc31xx_sl_net.h"
#include "osi.h"

#ifndef CFG_SL_CL_BUF_LEN
#define BUF_LEN          2048 /*Buffer length*/
#else
#define BUF_LEN          CFG_SL_CL_BUF_LEN
#endif

#ifndef CFG_SL_CL_MAX_MQP
#define MAX_MQP          2 /* # of buffers */
#else
#define MAX_MQP          CFG_SL_CL_MAX_MQP
#endif

#ifndef CFG_SL_CL_STACK
#define OSI_STACK_SIZE 2048
#else
#define OSI_STACK_SIZE CFG_SL_CL_STACK
#endif
//*****************************************************************************
// global variables used
//*****************************************************************************


struct sl_client_ctx {
        /* Client information details */
        char *client_id;
        char *usr_name;
        char *usr_pwd;
        SlMqttWill_t mqtt_will;

        /* Client management variables */
        bool in_use;
        char awaited_ack;
        _u16 conn_ack;

        /*Sync Object used to ensure single inflight message -
          used in blocking mode to wait on ack*/
        _SlSyncObj_t ack_sync_obj;
        /* Suback QoS pointer to store passed by application */
        char *suback_qos;

        /* Application information */
        void* app_hndl;
        SlMqttClientCbs_t app_cbs;

        /* Library information */
        void *cli_hndl;
        bool blocking_send;
};

#ifndef CFG_CL_MQTT_CTXS
#define MAX_SIMULTANEOUS_SERVER_CONN 4
#else
#define MAX_SIMULTANEOUS_SERVER_CONN CFG_MQTT_CL_CTXS
#endif


static struct sl_client_ctx sl_cli_ctx[MAX_SIMULTANEOUS_SERVER_CONN];

/* Lock Object to be passed to the MQTT lib */
_SlLockObj_t mqtt_lib_lockobj;

/* Creating a pool of MQTT coonstructs that can be used by the MQTT Lib
     mqp_vec =>pointer to a pool of the mqtt packet constructs
      buf_vec => the buffer area which is attached with each of mqp_vec*/
DEFINE_MQP_BUF_VEC(MAX_MQP, mqp_vec, BUF_LEN, buf_vec);

/*Task Priority and Response Time*/
u32 g_wait_secs;

bool g_multi_srvr_conn = false;

/* Receive task handle */
OsiTaskHandle g_rx_task_hndl;

/* Synchronization object used between the Rx and App task */
_SlSyncObj_t g_rx_tx_sync_obj;

#define RX_TX_SIGNAL_WAIT()     sl_SyncObjWait(&g_rx_tx_sync_obj,SL_OS_WAIT_FOREVER)
#define RX_TX_SIGNAL_POST()     sl_SyncObjSignal(&g_rx_tx_sync_obj)

static _SlLockObj_t mt_lock;    /* Multi-task Lock */

#define MT_LOCK_TAKE()   sl_LockObjLock(&mt_lock, OSI_WAIT_FOREVER);
#define MT_LOCK_GIVE()   sl_LockObjUnlock(&mt_lock);

#define SET_COND_AWAITED_ACK_LOCKED(client_ctx, cond, val) {      \
                MT_LOCK_TAKE();                                   \
                if(cond == client_ctx->awaited_ack)               \
                        client_ctx->awaited_ack = val;            \
                MT_LOCK_GIVE();                                   \
        }

/* MQTT Quality of Service */
static _const enum mqtt_qos qos[] ={
        MQTT_QOS0,
        MQTT_QOS1,
        MQTT_QOS2
};

/* Network Services specific to cc3200*/
struct device_net_services net = {
		comm_open,
		tcp_send,
		tcp_recv,
		send_dest,
		recv_from,
		comm_close,
		tcp_listen,
		tcp_accept,
		tcp_select,
		rtc_secs
};
        
/* Defining Retain Flag. Getting retain flag bit from fixed header*/
#define MQP_PUB_RETAIN(mqp)    ( ((mqp->fh_byte1 ) & 0x01)?true:false )

/*Defining Duplicate flag. Getting Duplicate flag bit from fixed header*/
#define MQP_PUB_DUP(mqp)        (((mqp->fh_byte1>>3) & 0x01)?true:false )

/*Defining QOS value. Getting QOS value from fixed header*/
#define MQP_PUB_QOS(mqp)        ((mqp->fh_byte1 >>1)  & 0x03)

#define ACK_RX_SIGNAL_WAIT(ack_sync_obj)     sl_SyncObjWait(ack_sync_obj,SL_OS_WAIT_FOREVER)    
#define ACK_RX_SIGNAL_POST(ack_sync_obj)     sl_SyncObjSignal(ack_sync_obj)


#define STR2UTF_CONV(utf_s, str) {utf_s.buffer = (char *)str; utf_s.length = strlen(str);}

/*Defining Event Messages*/
#define MQTT_ACK "Ack Received from server"
#define MQTT_ERROR "Connection Lost with broker"

//*****************************************************************************
// Wait for the response (callback) from the server (network)
//*****************************************************************************
_i32 _sl_ExtLib_ServerAckLockedWait(struct sl_client_ctx *client_ctx)
{
        _i32 rc = 0;

        MT_LOCK_TAKE();
        if(true == client_ctx->blocking_send) {
                MT_LOCK_GIVE();
                ACK_RX_SIGNAL_WAIT(&(client_ctx->ack_sync_obj));
                MT_LOCK_TAKE();
                rc = (MQTT_DISCONNECT == client_ctx->awaited_ack)?
                      MQP_ERR_NOTCONN : 0;
        }

        MT_LOCK_GIVE();

        return rc;
}

//*****************************************************************************
// Set (unprotected) in the implementation the value of the ACK from the server 
//*****************************************************************************
bool _sl_ExtLib_AwaitedAckSet(struct sl_client_ctx *client_ctx, _u8 newAwaited)
{
        bool rc = false;

        if(MQTT_DISCONNECT == client_ctx->awaited_ack)
                goto _sl_ExtLib_AwaitedAckSetExit1;

        client_ctx->awaited_ack = newAwaited;
        rc = true;

_sl_ExtLib_AwaitedAckSetExit1:

        return rc;
}

//*****************************************************************************
// Set (protected) in the implementation the value of the ACK from the server 
//*****************************************************************************
bool
_sl_ExtLib_AwaitedAckLockedSet(struct sl_client_ctx *client_ctx, _u8 newAwaited)
{
        bool rc;

        MT_LOCK_TAKE();
        rc = _sl_ExtLib_AwaitedAckSet(client_ctx, newAwaited);
        MT_LOCK_GIVE();

