FranciscoLlobet/efm32-freertos-zig/csrc/system/cc3100-sdk/netapps/mqtt/sl/sl_mqtt_client.c
                if(ret < 0) {
                        goto mqtt_connect_exit1;
                }
        }

        client_ctx->conn_ack = 0;
        client_ctx->awaited_ack  = MQTT_CONNACK;
        MT_LOCK_GIVE();

        /* Connect to the server */
        ret = mqtt_connect_msg_send(client_ctx->cli_hndl, clean,
                                    keep_alive_time);
        /*Network or Socket Error happens*/
        if(ret < 0) {
                SET_COND_AWAITED_ACK_LOCKED(client_ctx, MQTT_CONNACK,
                                            MQTT_DISCONNECT);
                goto mqtt_connect_exit2;
        }

        MT_LOCK_TAKE();
        if(false == g_multi_srvr_conn) {
                /* Unblock the receive task here */        
                RX_TX_SIGNAL_POST();
        }
        MT_LOCK_GIVE();

        /* Wait for a CONNACK here */
        ACK_RX_SIGNAL_WAIT(&(client_ctx->ack_sync_obj));

        MT_LOCK_TAKE();
        if(MQTT_DISCONNECT != client_ctx->awaited_ack)
                ret = (_i32)client_ctx->conn_ack;
        
mqtt_connect_exit1:
        client_ctx->conn_ack = 0;
        MT_LOCK_GIVE();

mqtt_connect_exit2:
        return ret;
}

//*****************************************************************************
// sl_ExtLib_MqttClientDisconnect
//*****************************************************************************
_i32
sl_ExtLib_MqttClientDisconnect(void *cli_ctx)
{
        struct sl_client_ctx *client_ctx = (struct sl_client_ctx *)cli_ctx;
        _i32 retval = MQP_ERR_NOTCONN;

#define MQTT_DISCONNECT_CB  0xCB /* Custom define for implementation ease */

        if(_sl_ExtLib_AwaitedAckLockedSet(client_ctx,
                                          MQTT_DISCONNECT_CB) == false)
                goto mqtt_disconn_exit1; /* Already disconnected - quit */

        /* send the disconnect command. */
        retval = mqtt_disconn_send(client_ctx->cli_hndl);     
        if(retval >= 0) {
                ACK_RX_SIGNAL_WAIT(&(client_ctx->ack_sync_obj));
        }

 mqtt_disconn_exit1:
        return (retval >= 0)? 0 : retval;
}


//*****************************************************************************
// sl_ExtLib_MqttClientSub
//*****************************************************************************
_i32 
sl_ExtLib_MqttClientSub(void *cli_ctx, char* _const *topics,
                        _u8 *qos_level, _i32 count)
{
#define MAX_SIMULTANEOUS_SUB_TOPICS 4

        _i32 ret = MQP_ERR_FNPARAM, i;

        struct utf8_strqos qos_topics[MAX_SIMULTANEOUS_SUB_TOPICS];
        struct sl_client_ctx *client_ctx = (struct sl_client_ctx *)cli_ctx;

		if(count > MAX_SIMULTANEOUS_SUB_TOPICS) {
                goto mqtt_sub_exit1;  /* client not connected*/
        }

        for(i = 0; i < count; i++) {
                qos_topics[i].buffer = topics[i];
                qos_topics[i].qosreq = qos[qos_level[i]];
                qos_topics[i].length = strlen(topics[i]);
        }

        ret = MQP_ERR_NOTCONN;

        MT_LOCK_TAKE();
        if(_sl_ExtLib_AwaitedAckSet(client_ctx, MQTT_SUBACK) == false) {
                MT_LOCK_GIVE();
                goto mqtt_sub_exit1;
        }

        client_ctx->suback_qos  = (char*)qos_level;
        MT_LOCK_GIVE();

        /* Send the subscription MQTT message */
        ret = mqtt_sub_msg_send(client_ctx->cli_hndl, qos_topics, count);
        if(ret < 0) {
                SET_COND_AWAITED_ACK_LOCKED(client_ctx, MQTT_SUBACK, 0);
                goto mqtt_sub_exit1;
        }

        ret = _sl_ExtLib_ServerAckLockedWait(client_ctx);

 mqtt_sub_exit1:
        return (ret >= 0)? 0: ret;
}


//*****************************************************************************
// sl_ExtLib_MqttClientUnsub
//*****************************************************************************
_i32
sl_ExtLib_MqttClientUnsub(void *cli_ctx, char* _const *topics, _i32 count)
{
#define MAX_SIMULTANEOUS_UNSUB_TOPICS 4

        _i32 ret = MQP_ERR_FNPARAM, i;
        struct utf8_string unsub_topics[MAX_SIMULTANEOUS_UNSUB_TOPICS];
        struct sl_client_ctx *client_ctx = (struct sl_client_ctx *)cli_ctx;

        if(count > MAX_SIMULTANEOUS_UNSUB_TOPICS) {
                goto mqtt_unsub_exit1;
        }

        for(i = 0; i < count; i++) {
                STR2UTF_CONV(unsub_topics[i], topics[i]);
        }

        ret = MQP_ERR_NOTCONN;
        if(_sl_ExtLib_AwaitedAckLockedSet(client_ctx, MQTT_UNSUBACK) == false)
                goto mqtt_unsub_exit1;

        /* Send the unsubscription MQTT message */
        ret = mqtt_unsub_msg_send(client_ctx->cli_hndl, unsub_topics, count);
        if(ret < 0) {
                SET_COND_AWAITED_ACK_LOCKED(client_ctx, MQTT_UNSUBACK, 0);
                goto mqtt_unsub_exit1;
        }

        ret = _sl_ExtLib_ServerAckLockedWait(client_ctx);

 mqtt_unsub_exit1:
        return (ret >= 0)? 0 : ret;
}
//*****************************************************************************
// sl_ExtLib_MqttClientSend
//*****************************************************************************
_i32 
sl_ExtLib_MqttClientSend(void *cli_ctx, _const char *topic,
                         _const void *data, _i32 len, 
                         _u8 qos_level, bool retain)
{
        _i32 ret = MQP_ERR_FNPARAM;
        struct utf8_string topic_utf8;
        struct sl_client_ctx *client_ctx = (struct sl_client_ctx *)cli_ctx;

        _u8 awaited_acks[] = {0 /* connected */, MQTT_PUBACK, MQTT_PUBCOMP};
        _u8 awaited_ack;

        if(len > BUF_LEN)
                goto mqtt_pub_exit1;
        
        if(qos_level > 2)
                goto mqtt_pub_exit1;

        STR2UTF_CONV(topic_utf8, topic);

        awaited_ack = awaited_acks[qos_level];
        ret = MQP_ERR_NOTCONN;

        if(_sl_ExtLib_AwaitedAckLockedSet(client_ctx, awaited_ack) == false)
                goto mqtt_pub_exit1;

        /*publish the message*/
        ret = mqtt_client_pub_msg_send(client_ctx->cli_hndl, &topic_utf8,
                                       data, len, qos[qos_level], retain);
        if(ret < 0) {
                SET_COND_AWAITED_ACK_LOCKED(client_ctx, awaited_ack, 0);
                goto mqtt_pub_exit1;
        }

        if(qos_level)
                ret = _sl_ExtLib_ServerAckLockedWait(client_ctx);

 mqtt_pub_exit1:
	    return (ret >= 0)? 0 : ret;
}


